Revit 2027 API
BuiltInFailures.SiteFailures.BuildingPadOverlap Property
 Pads can't overlap (but can share edges).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId BuildingPadOverlap { get; }
Public Shared ReadOnly Property BuildingPadOverlap As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ BuildingPadOverlap {
	FailureDefinitionId^ get ();
}
static member BuildingPadOverlap : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace